app/Models/ModelPresensi.php

SELECT *
FROM `tbl_presensi`
WHERE `id_karyawan` = '1'
AND `tgl_presensi` = '2023-03-26'
---
    public function cekPresensi()
    {
        return $this->db->table('tbl_presensi')
        ->where('id_karyawan', session()->get('id_karyawan'))
        ->where('tgl_presensi', date('Y-m-d'))
        ->get()->getRowArray();

SELECT *
FROM `tbl_setting`
WHERE `id_setting` = 1
---
    public function dataKantor()
    {
        return $this->db->table('tbl_setting')
        ->where('id_setting', 1)->get()->getRowArray();

INSERT INTO `tbl_presensi` (`id_karyawan`, `tgl_presensi`, `jam_in`, `lokasi_in`, `foto_in`) VALUES ('1', '2023-04-03', '09:42:29', '-7.2574719,112.7520883', '1-2023-04-03-094229.png')
---
    public function insertPresensiIn($data)
    {
        $this->db->table('tbl_presensi')->insert($data);