app/Models/ModelAuth.php

SELECT *
FROM `tbl_karyawan`
WHERE `username` = 'asasasa'
AND `password` = '761ee866d554db1c7582326a910fac8b9764c345'
---
    public function loginKaryawan($username, $password)
    {
        return $this->db->table('tbl_karyawan')
        ->where([
            'username' => $username,
            'password' => $password,
        ])->get()->getRowArray();

SELECT *
FROM `tbl_user`
WHERE `username` = 'admin'
AND `password` = '88ea39439e74fa27c09a4fc0bc8ebe6d00978392'
---
    public function loginUser($username, $password)
    {
        return $this->db->table('tbl_user')
        ->where([
            'username' => $username,
            'password' => $password,
        ])->get()->getRowArray();